loadTest/loadTest.yml
config:
  target: "http://localhost:3002"
  http:
    timeout: 2
    pool: 10
  phases:
    - name: "ramp up"
      duration: 10
      arrivalRate: 1
      rampTo: 20
    - name: "sustained load"
      duration: 10
      arrivalRate: 20
  processor: "./loadTestHelpers.js"
scenarios:
  - name: "get popular id"
    weight: 80
    beforeRequest: "setPopularId"
    flow:
      - loop:
        - get:
            url: "/api/restaurants/{{ id }}/overview"
        count: 1000
  - name: "get regular id"
    weight: 20
    beforeRequest: "setRegularId"
    flow:
      - loop:
        - get:
            url: "/api/restaurants/{{ id }}/overview"
        count: 1000